RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (Ellipse, Interval)
 Converts the specified Rhino.Geometry.Ellipse within the given Rhino.Geometry.Intervalto an equivalent of Autodesk.Revit.DB.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.Ellipse ellipse,
	Rhino.Geometry.Interval interval
)
@staticmethod
def ToCurve(
	ellipse: Rhino.Geometry.Ellipse,
	interval: Rhino.Geometry.Interval
) -> Autodesk.Revit.DB.Curve
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
Rhino ellipse to convert.
interval
Type: Rhino.Geometry.Interval
Interval where the ellipse is defined.
Return Value
Type: Autodesk.Revit.DB.Curve
Revit curve that is equivalent to the provided Rhino ellipse within the given interval
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Ellipse. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(Ellipse, Interval) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
var interval = new Interval(0.0, 0.5);
DB.Curve revitCurve = rhinoEllipse.ToCurve(interval);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
interval = Interval(0.0, 0.5);
revit_curve = rhino_ellipse.ToCurve(interval)    # type: DB.Curve
 Using ToCurve(Ellipse, Interval) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
var interval = new Interval(0.0, 0.5);
DB.Curve revitCurve = GeometryEncoder.ToCurve(rhinoEllipse, interval);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
interval = Interval(0.0, 0.5)
revit_curve = GE.ToCurve(rhino_ellipse, interval)    # type: DB.Curve
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace